// 防止变量污染,我用一个立即执行函数包起来,使里面的变量是局部的
(function(){
    // (21, 94)  定义变量和函数
    // (96, 283)  添加方法和属性
    // (285, 347) jQuery 继承方法
    // (349, 817) 拓展工具方法
    // (877, 2856) sizzle选择器
    // (2880, 3042) callbacks回调函数
    // (3043, 3183) deferred延迟对象
    // (3184, 3295) support功能检测
    // (3308, 3652) data 数据缓存
    // (3653, 3797) queue 队列管理功能
    // (3798, 4299) attr() prop() val() addClass() 元素属性操作
    // (4300, 5128) on() trigger() 事件操作
    // (5140, 6057) DOM操作
    // (6058, 6620) css样式
    // (6621, 7854) ajax
    // (7855, 8584) anmiate运动操作
    // (8585, 8792) offset() scrotop() 位置和尺寸
    // (8793, 8821) 模块化
    // (8826) window.jQuery = window.$ = jQuery
})();